[
  {
    "id": "card-flipper-bot",
    "name": "Card Flipper Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1325707530436870205/fb48f898420df790d124501af8bb862b.png?size=512",
    "bannerImage": "/litarena/screenshots/card-flipper-bot/banner.png",
    "description": "Your ultimate Pokemon card value tracking assistant! Card Flipper Bot analyzes PSA card prices from GameStop, identifies undervalued cards with profit potential, and provides detailed market analytics to help you make informed trading decisions.",
    "status": "active",
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1325707530436870205",
    "features": [
      "Real-time PSA card price tracking from GameStop",
      "Automated profit/loss analysis with percentage calculations",
      "Interactive price trend charts and visualizations",
      "Automatic alerts for undervalued cards with profit potential",
      "Weekly profit snapshots and comprehensive statistics",
      "Grade comparison analysis (PSA 6-10)",
      "Social media integration (Twitter/Instagram posting)",
      "Advanced card matching with character abbreviations",
      "Detailed sales history from PSA auction results",
      "Queue management system for high-volume processing"
    ],
    "screenshots": [
      "/litarena/screenshots/card-flipper-bot/screenshot-1.png"
    ],
    "videos": [
      "/litarena/screenshots/card-flipper-bot/video-1.mov"
    ],
    "pricing": {
      "model": "subscription",
      "tiers": [
        {
          "name": "Slab Flips",
          "price": "$29.99",
          "period": "month",
          "features": [
            "Automatic alerts for undervalued cards",
            "Advanced analytics and charts"
          ],
          "popular": true
        }
      ]
    },
    "changelog": [
      {
        "version": "2.1.3",
        "date": "2025-01-15",
        "changes": [
          "Enhanced Instagram integration with rate limiting",
          "Improved error handling and logging",
          "Added subscription channel validation"
        ]
      },
      {
        "version": "2.1.0",
        "date": "2025-01-10",
        "changes": [
          "Added Instagram posting functionality",
          "Implemented advanced rate limiting",
          "Enhanced chart creation with QuickChart"
        ]
      },
      {
        "version": "2.0.0",
        "date": "2025-01-05",
        "changes": [
          "Major rewrite with subscription system",
          "Added Discord premium features integration",
          "Improved PSA data scraping"
        ]
      },
      {
        "version": "1.0.6",
        "date": "2025-01-01",
        "changes": [
          "Fixed bug with card flipping calculations",
          "Enhanced price comparison accuracy"
        ]
      }
    ],
    "tos": {
      "title": "Terms of Service",
      "sections": [
        {
          "heading": "1. Acceptance of Terms",
          "content": "By using Card Flipper Bot, you agree to these Terms of Service. If you disagree with any part of the terms, you do not have permission to use the Bot."
        },
        {
          "heading": "2. Description of Service",
          "content": "Card Flipper Bot tracks PSA card prices from GameStop, provides price comparisons and profit analysis, creates data visualizations, monitors specific channels for card listings, manages keyword-based notifications, and posts updates to social media platforms."
        },
        {
          "heading": "3. Premium Features",
          "content": "Premium features may be offered for additional fees. Payments are processed through Discord's payment system. Premium subscribers get access to automatic alerts, advanced analytics, and priority processing. No refunds will be issued for premium features."
        },
        {
          "heading": "4. Data Usage",
          "content": "The Bot collects and stores card price data, user commands and interactions, server configurations, button click analytics, and user preferences for notification settings. All data is used solely to provide bot functionality."
        },
        {
          "heading": "5. Limitations",
          "content": "The Bot provides price information for educational purposes only. Users are responsible for verifying all data before making purchasing decisions. We are not liable for any financial losses resulting from bot usage."
        }
      ]
    },
    "privacy": {
      "title": "Privacy Policy",
      "sections": [
        {
          "heading": "1. Data Collection",
          "content": "We collect Discord user IDs, server IDs, channel IDs, command usage data, button interaction data, card price tracking preferences, and subscription status information necessary for bot operation."
        },
        {
          "heading": "2. Data Usage",
          "content": "Collected data is used to provide bot functionality, track feature usage, improve service quality, maintain user preferences, generate analytics reports, and manage subscription services."
        },
        {
          "heading": "3. Data Security",
          "content": "We implement appropriate security measures to protect user data from unauthorized access, modification, disclosure, and destruction. Data is stored securely and access is limited to essential operations."
        },
        {
          "heading": "4. Third-Party Services",
          "content": "The Bot integrates with Twitter API, Instagram Basic Display API, GameStop website, PSA website, QuickChart API for visualizations, and Discord's subscription services."
        },
        {
          "heading": "5. Data Retention",
          "content": "User data is retained only as long as necessary to provide services. Users may request data deletion by contacting support, subject to legal and operational requirements."
        }
      ]
    },
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1325707530436870205"
  },
  {
    "id": "mercari-japan-bot",
    "name": "Mercari Japan Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1354826669885489292/5ed6992e17e2e92783df5f0599908d0f.png?size=512",
    "bannerImage": "/litarena/screenshots/mercari-japan-bot/banner.png",
    "description": "Advanced Mercari Japan monitoring bot with real-time listing alerts, auto-translation, currency conversion, and comprehensive notification systems. Provides personal alerts, server-wide monitoring, role pings, watchlist management, and sophisticated subscription tiers for collectors, resellers, and communities seeking rare Japanese marketplace finds.",
    "status": "active",
    "features": [
      "Real-time Mercari Japan monitoring with dynamic check intervals",
      "Advanced API integration with protobuf parsing and DPoP authentication",
      "Intelligent auto-translation from Japanese to English with verification",
      "Live currency conversion with exchange rate API integration",
      "Comprehensive subscription tier system (Trial through Tier 5)",
      "Personal alert system with custom search criteria and exclude terms",
      "Server-wide keyword monitoring with administrator controls",
      "Role ping system with keyword and price-based filtering",
      "Watchlist functionality with item status tracking",
      "Auction detection and monitoring with end-time alerts",
      "Flagged seller system with community-driven warnings",
      "Rich embed formatting with images, pricing, and detailed info",
      "Interactive button systems for item details and watchlist management",
      "Webhook delivery support for custom Discord integrations",
      "Global keyword system with server-specific toggle controls",
      "Trial feedback collection with rating and analytics systems",
      "Advanced condition filtering (1-6 scale from new to poor)",
      "Price range filtering with JPY and USD display",
      "Seller rating and review integration with quick shipper badges",
      "Comment system integration with recent activity display",
      "Category-based filtering with translated category names",
      "Shipping information display with duration and cost details",
      "Professional slash command interface with auto-completion",
      "Comprehensive admin permission system with role-based access",
      "Database persistence with JSON storage and backup systems",
      "Statistical analysis with keyword performance tracking",
      "Exchange rate monitoring with hourly updates",
      "Comprehensive error handling and logging system",
      "Mobile-optimized interface with ephemeral message support",
      "Multi-server support with isolated configurations"
    ],
    "screenshots": [
      "/litarena/screenshots/mercari-japan-bot/screenshot-1.png",
      "/litarena/screenshots/mercari-japan-bot/screenshot-2.png",
      "/litarena/screenshots/mercari-japan-bot/screenshot-3.png",
      "/litarena/screenshots/mercari-japan-bot/screenshot-4.png",
      "/litarena/screenshots/mercari-japan-bot/screenshot-5.png"
    ],
    "videos": [],
    "pricing": {
      "model": "subscription",
      "tiers": [
        {
          "name": "Trial",
          "price": "$0",
          "period": "7 days",
          "features": [
            "Test all features",
            "Limited duration access",
            "Full monitoring capabilities"
          ]
        },
        {
          "name": "Tier 1",
          "price": "$4.99",
          "period": "month",
          "features": [
            "Basic monitoring",
            "Personal alerts",
            "Standard support"
          ],
          "popular": true
        },
        {
          "name": "Tier 2",
          "price": "$9.99",
          "period": "month",
          "features": [
            "Everything in Tier 1",
            "Server-wide monitoring",
            "Role ping system"
          ]
        },
        {
          "name": "Tier 3",
          "price": "$14.99",
          "period": "month",
          "features": [
            "Everything in Tier 2",
            "Watchlist management",
            "Priority processing"
          ]
        },
        {
          "name": "Tier 4",
          "price": "$29.99",
          "period": "month",
          "features": [
            "Everything in Tier 3",
            "Advanced filtering",
            "Dedicated support"
          ]
        },
        {
          "name": "Tier 5",
          "price": "$39.99",
          "period": "month",
          "features": [
            "Everything in Tier 4",
            "Premium features",
            "VIP support",
            "Custom configurations"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "5.2.0",
        "date": "2025-01-15",
        "changes": [
          "Implemented flexible monitoring system with dynamic interval control",
          "Added comprehensive autocomplete for all major slash commands",
          "Enhanced auction info handling with proper protobuf object parsing",
          "Added advanced translation verification for keyword management",
          "Implemented monitoring control commands (start/stop/status/interval)",
          "Enhanced watchlist system with auction status tracking",
          "Added currency autocomplete for exchange rate commands",
          "Improved error handling for auction data extraction"
        ]
      },
      {
        "version": "5.0.0",
        "date": "2025-01-10",
        "changes": [
          "Complete migration to modern slash commands with deprecation warnings",
          "Added comprehensive personal alert system with webhook support",
          "Implemented watchlist functionality with item status monitoring",
          "Enhanced subscription system with trial feedback collection",
          "Added flagged seller system with community-driven warnings",
          "Implemented advanced role ping system with filtering",
          "Added auction detection and monitoring capabilities",
          "Enhanced translation system with verification prompts"
        ]
      },
      {
        "version": "4.5.0",
        "date": "2025-01-05",
        "changes": [
          "Added trial feedback system with comprehensive analytics",
          "Implemented advanced server statistics and monitoring dashboard",
          "Enhanced global keyword system with server-specific controls",
          "Added comprehensive help system with command examples",
          "Implemented proxy service integration (Japan Rabbit)",
          "Added exchange rate monitoring with live updates",
          "Enhanced admin permission system with role-based access",
          "Added detailed server status checking and reporting"
        ]
      },
      {
        "version": "4.0.0",
        "date": "2024-12-20",
        "changes": [
          "Integrated Mercari Japan API with advanced authentication",
          "Added protobuf parsing for comprehensive item data",
          "Implemented subscription tier system with entitlements API",
          "Added comprehensive condition and price filtering",
          "Enhanced embed system with rich formatting and thumbnails",
          "Implemented database persistence with JSON storage",
          "Added seller information integration with ratings",
          "Enhanced error handling and logging system"
        ]
      },
      {
        "version": "3.0.0",
        "date": "2024-11-15",
        "changes": [
          "Added multi-server support with isolated configurations",
          "Implemented keyword statistics and performance tracking",
          "Enhanced translation system with multiple provider support",
          "Added comprehensive admin controls and permissions",
          "Implemented global keyword system with toggle controls",
          "Added detailed item information with seller data",
          "Enhanced notification system with role mentions",
          "Added comprehensive configuration management"
        ]
      },
      {
        "version": "2.0.0",
        "date": "2024-10-01",
        "changes": [
          "Added real-time monitoring with scheduled checks",
          "Implemented keyword-based filtering system",
          "Added price range filtering and currency conversion",
          "Enhanced embed formatting with images and details",
          "Added basic subscription tier enforcement",
          "Implemented channel configuration system",
          "Added translation capabilities for Japanese content",
          "Enhanced error handling and user feedback"
        ]
      },
      {
        "version": "1.0.0",
        "date": "2024-09-01",
        "changes": [
          "Initial release with basic Mercari Japan scraping",
          "Simple keyword monitoring and notifications",
          "Basic Discord integration with embed messages"
        ]
      }
    ],
    "tos": {
      "title": "Terms of Service",
      "sections": [
        {
          "heading": "1. Acceptance of Terms",
          "content": "By using Mercari Japan Bot, you agree to these Terms of Service. This bot provides marketplace monitoring and notification services for educational and informational purposes related to Mercari Japan marketplace intelligence."
        },
        {
          "heading": "2. Description of Service",
          "content": "Mercari Japan Bot provides real-time monitoring of Mercari Japan listings, automated notifications, price tracking, personal alert systems, watchlist management, translation services, and comprehensive marketplace analysis through integration with Mercari Japan's API and related services."
        },
        {
          "heading": "3. Data Sources and Accuracy",
          "content": "Market data is sourced directly from Mercari Japan's official API. While we strive for accuracy, data may have delays or inaccuracies due to API limitations or network issues. Users should verify all information independently before making purchasing decisions. Real-time monitoring operates on 15-minute intervals."
        },
        {
          "heading": "4. Permitted Use",
          "content": "Users may use the bot for marketplace research, price monitoring, collecting guidance, educational purposes, and legitimate business research. All usage must comply with Mercari Japan's terms of service and applicable laws. Personal alerts and watchlist features are provided for individual user convenience."
        },
        {
          "heading": "5. Prohibited Activities",
          "content": "Users may not use the bot for market manipulation, fraudulent activities, excessive automated requests that could impact service availability, violation of Mercari Japan's or Discord's terms of service, harassment of sellers, or any activities that violate applicable laws or regulations."
        },
        {
          "heading": "6. Subscription Tiers and Billing",
          "content": "The bot operates on a subscription tier system managed through Discord's Server Subscriptions. Trial periods are limited to 7 days per server. Subscription management, billing, and refunds are handled exclusively through Discord's platform. Keyword limits are enforced based on active subscription tier."
        },
        {
          "heading": "7. Personal Alerts and Notifications",
          "content": "Personal alert systems require user setup and configuration. Webhook URLs must be valid and secure. Users are responsible for managing their alert criteria and delivery preferences. We are not liable for missed notifications due to Discord outages, API limitations, or user configuration errors."
        },
        {
          "heading": "8. Watchlist and Data Management",
          "content": "Watchlist data is stored securely and associated with Discord user IDs. Users can remove items from their watchlist at any time. Flagged seller data is community-driven and provided for informational purposes only. Users should exercise independent judgment when evaluating sellers."
        },
        {
          "heading": "9. Service Availability",
          "content": "Service availability depends on Mercari Japan API access, Discord platform availability, and server infrastructure. We reserve the right to modify features, implement usage limits, temporarily suspend service for maintenance, or discontinue the service with reasonable notice to users."
        },
        {
          "heading": "10. Translation Services",
          "content": "Translation services are provided through third-party APIs and may not be 100% accurate. Users should verify translations independently for critical information. Translation verification prompts are provided to help ensure accuracy, but users are responsible for final translation decisions."
        }
      ]
    },
    "privacy": {
      "title": "Privacy Policy",
      "sections": [
        {
          "heading": "1. Data Collection",
          "content": "We collect Discord user IDs, server IDs, guild information, command usage data, search keywords, alert configurations, watchlist data, subscription status, feedback submissions, and interaction analytics necessary for bot operation and service improvement."
        },
        {
          "heading": "2. Marketplace Data Processing",
          "content": "Marketplace data is sourced from Mercari Japan's official API, processed in real-time, and temporarily cached for performance. Search queries and alert criteria are stored to provide ongoing monitoring services. Item data is cached to prevent duplicate notifications and improve response times."
        },
        {
          "heading": "3. Personal Alert Data",
          "content": "Personal alert configurations including search terms, price ranges, condition preferences, and delivery methods are stored securely and associated with user IDs. Webhook URLs are encrypted and used only for notification delivery. Users can delete alert data at any time through bot commands."
        },
        {
          "heading": "4. Watchlist Management",
          "content": "Watchlist data includes item IDs, titles, prices, seller information, and status tracking data. This information is stored to provide ongoing item monitoring and status updates. Users can remove items from their watchlist or clear all watchlist data through bot commands."
        },
        {
          "heading": "5. Subscription and Billing",
          "content": "Subscription status is tracked through Discord's Entitlements API. We do not store payment information, which is handled exclusively by Discord. Subscription data is used only for feature access control and service provisioning. Trial usage is tracked to prevent abuse."
        },
        {
          "heading": "6. Translation and Language Services",
          "content": "Translation requests are processed through third-party translation APIs. Search terms and item titles may be temporarily transmitted to translation services for processing. No personal information is included in translation requests, and translated data is not permanently stored by translation providers."
        },
        {
          "heading": "7. Community Features",
          "content": "Flagged seller data includes seller IDs, flag reasons, and reporting user IDs for moderation purposes. Trial feedback includes ratings, comments, and server information for service improvement. Community data is aggregated and anonymized for analytics purposes."
        },
        {
          "heading": "8. Data Security",
          "content": "We implement appropriate security measures including encrypted data transmission, secure API authentication with DPoP tokens, access logging and monitoring, regular security audits, secure storage of user configurations, and protection of webhook URLs and sensitive user data."
        },
        {
          "heading": "9. Third-Party Integration",
          "content": "The bot integrates with Mercari Japan API, Discord's platform and services, translation APIs (Google Translate), exchange rate APIs, GitHub for documentation hosting, webhook services for notifications, and Discord's Entitlements API for subscription management."
        },
        {
          "heading": "10. Data Retention",
          "content": "Command usage logs are retained for 30 days for debugging purposes. Alert configurations are retained until deleted by users. Watchlist data is maintained for active monitoring. Trial feedback is retained for service improvement. Market data cache is cleared regularly to ensure freshness."
        },
        {
          "heading": "11. User Rights",
          "content": "Users can request information about their stored data, delete personal alert configurations, clear watchlist data, remove saved searches, request account data deletion, opt out of feedback collection, and remove the bot from their server to stop data collection."
        },
        {
          "heading": "12. Analytics and Improvement",
          "content": "We analyze usage patterns to improve monitoring accuracy, optimize notification systems, enhance translation quality, develop new features, maintain service reliability, and provide better user experiences. All analytics data is anonymized and aggregated."
        }
      ]
    },
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1354826669885489292"
  },
  {
    "id": "auto-pinger-bot",
    "name": "Auto Pinger Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1340932229450174465/fa14ced29206c9a91945c1d8477b8d4a.png?size=512",
    "bannerImage": "/litarena/screenshots/auto-pinger-bot/banner.png",
    "description": "The ultimate Discord keyword monitoring and notification system with advanced role management, interactive request handling, and intelligent message forwarding. Auto Pinger Bot provides comprehensive server automation for communities that need reliable, customizable notification systems with enterprise-grade features.",
    "status": "active",
    "features": [
      "Advanced keyword detection with OR, AND, and EXACT phrase matching",
      "Interactive request system with approval/denial buttons and persistent views",
      "Automatic role creation with custom names and hex color support",
      "Intelligent message forwarding with rich embed preservation",
      "Multi-channel monitoring with individual cooldown controls",
      "Auto-ping functionality for complete channel monitoring",
      "Comprehensive role management and cleanup utilities",
      "Request history tracking with detailed analytics",
      "Embed and attachment content scanning for complete coverage",
      "Permission-aware setup with automatic bot access management",
      "Manager role hierarchy with administrator controls",
      "Real-time DM notifications for request status updates",
      "Backup and recovery system for configuration protection",
      "Silent forwarding options for discrete monitoring",
      "Jump links and source tracking in forwarded messages",
      "Custom emoji detection and Unicode support",
      "Phrase-based keyword matching with quote support",
      "Bot-created role tracking and unused role detection",
      "Interactive help system with comprehensive command documentation",
      "Persistent button functionality that survives bot restarts"
    ],
    "screenshots": [
      "/litarena/screenshots/auto-pinger-bot/screenshot-1.png",
      "/litarena/screenshots/auto-pinger-bot/screenshot-2.png"
    ],
    "videos": [],
    "pricing": {
      "model": "free",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "All bot features",
            "Unlimited servers",
            "Community support"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "2.0.0",
        "date": "2025-01-15",
        "changes": [
          "Complete rewrite with interactive button system",
          "Added message forwarding with rich embed support",
          "Implemented automatic role creation with custom colors",
          "Added persistent view system for bot restart resilience",
          "Enhanced keyword matching with AND/OR/EXACT logic",
          "Added comprehensive role management and cleanup",
          "Implemented request history tracking and analytics",
          "Added silent forwarding and discrete monitoring options"
        ]
      },
      {
        "version": "1.5.0",
        "date": "2024-12-10",
        "changes": [
          "Added auto-ping functionality for complete channel monitoring",
          "Enhanced permission management and bot access controls",
          "Improved cooldown system with per-channel configuration",
          "Added embed and attachment content scanning"
        ]
      },
      {
        "version": "1.0.0",
        "date": "2024-11-01",
        "changes": [
          "Initial release with basic keyword pinger functionality",
          "Manager role system implementation",
          "Configuration backup and recovery system"
        ]
      }
    ],
    "tos": {
      "title": "Terms of Service",
      "sections": [
        {
          "heading": "1. Acceptance of Terms",
          "content": "By using Auto Pinger Bot, you agree to these Terms of Service. If you disagree with any part of the terms, you do not have permission to use the Bot."
        },
        {
          "heading": "2. Description of Service",
          "content": "Auto Pinger Bot provides keyword monitoring, role management, message forwarding, and notification services for Discord servers. The bot creates and manages roles, monitors messages across channels, sends notifications based on keyword matches, and provides comprehensive server automation tools."
        },
        {
          "heading": "3. User Responsibilities",
          "content": "Users are responsible for appropriate keyword selection, role management, and ensuring bot permissions are properly configured. Server administrators must set appropriate manager roles and monitor bot usage to prevent spam or abuse."
        },
        {
          "heading": "4. Data Usage",
          "content": "The Bot collects and stores server configurations, user requests, role information, keyword lists, message metadata for forwarding, and usage analytics. All data is used solely to provide bot functionality and improve service quality."
        },
        {
          "heading": "5. Limitations and Disclaimers",
          "content": "The Bot provides notification services on a best-effort basis. We are not liable for missed notifications, false positives, or any consequences resulting from bot usage. Users should verify critical notifications through alternative means."
        },
        {
          "heading": "6. Service Modifications",
          "content": "We reserve the right to modify, suspend, or discontinue the service at any time. Users will be notified of significant changes when possible. Continued use constitutes acceptance of modifications."
        }
      ]
    },
    "privacy": {
      "title": "Privacy Policy",
      "sections": [
        {
          "heading": "1. Data Collection",
          "content": "We collect Discord server IDs, channel IDs, user IDs, role information, keyword configurations, message metadata for forwarding purposes, request history, and bot interaction data necessary for service operation."
        },
        {
          "heading": "2. Data Usage",
          "content": "Collected data is used to provide keyword monitoring, role management, message forwarding, request processing, service analytics, and feature improvements. Data is not shared with third parties except as required for bot functionality."
        },
        {
          "heading": "3. Data Security",
          "content": "We implement appropriate security measures including encrypted storage, backup systems, access controls, and regular security audits to protect user data from unauthorized access, modification, or disclosure."
        },
        {
          "heading": "4. Data Retention",
          "content": "Server configurations are retained while the bot is active in your server. Request history is maintained for administrative purposes. Users may request data deletion by removing the bot from their server or contacting support."
        },
        {
          "heading": "5. Third-Party Services",
          "content": "The Bot integrates with Discord's API and services. No other third-party services have access to your data. All processing occurs within Discord's infrastructure or our secure servers."
        },
        {
          "heading": "6. User Rights",
          "content": "Users have the right to access their data, request corrections, request deletion (subject to operational requirements), and withdraw consent by removing the bot from their server."
        }
      ]
    },
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1340932229450174465"
  },
  {
    "id": "aquamark",
    "name": "AquaMark",
    "icon": "https://cdn.discordapp.com/app-icons/1440594456490414225/c9d2685d2bc25fa91f136ebf43d9e17a.png?size=512",
    "bannerImage": "/litarena/screenshots/aquamark/banner.png",
    "description": "Professional image watermarking bot with advanced customization options for protecting digital content, branding images, and maintaining intellectual property rights.",
    "status": "active",
    "features": [
      "Text watermarks with full typography control",
      "Logo watermarks for brand placement",
      "Invisible steganographic watermarks (LSB technique)",
      "Batch processing for up to 10 images simultaneously",
      "Multiple positioning options (center, corners, tiled)",
      "Adjustable opacity, rotation, and color settings",
      "Professional presets (Photography, Copyright, Subtle, Bold)",
      "Save up to 10 custom watermark configurations",
      "Preview mode for low-resolution previews",
      "Metadata preservation and format optimization"
    ],
    "screenshots": [
      "/litarena/screenshots/aquamark/screenshot-1.png"
    ],
    "videos": [],
    "pricing": {
      "model": "free",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "All watermarking features",
            "Batch processing up to 10 images",
            "10 saved preferences per user",
            "All preset configurations",
            "Unlimited servers"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-01-01",
        "changes": [
          "Initial release with text and logo watermarking",
          "Batch processing support",
          "User preference management",
          "Professional preset configurations",
          "Invisible watermark steganography"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1440594456490414225"
  },
  {
    "id": "localtrust",
    "name": "LocalTrust",
    "icon": "https://cdn.discordapp.com/app-icons/1444097653821542410/8d5e24c70f068c32795932452fe32858.png?size=512",
    "bannerImage": "/litarena/screenshots/localtrust/banner.jpeg",
    "description": "Hyper-local marketplace and classifieds bot for Discord communities. Create listings, build reputation, verify users, and trade safely within university servers, neighborhood groups, and local hobbyist communities.",
    "status": "beta",
    "features": [
      "Structured marketplace listings with categories and conditions",
      "Global reputation system that follows users across servers",
      "Email and admin verification for trusted trading",
      "Smart search with keyword matching and filters",
      "Image support with up to 10 images per listing",
      "Watch alerts for instant notifications on wanted items",
      "Offer system for price negotiations",
      "Seller watchlist to follow favorite traders",
      "Safe meetup spot suggestions",
      "Dispute and report system for safety",
      "Premium features for power sellers",
      "Listing bumps to boost visibility",
      "Detailed analytics and transaction history"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "freemium",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "5 listings per day",
            "2 bumps per week",
            "3 watch alerts",
            "Full search and browse access",
            "Reputation building",
            "Verification support",
            "Offer and watchlist features"
          ]
        },
        {
          "name": "Premium Subscription",
          "price": "TBD",
          "period": "month",
          "features": [
            "20 listings per day",
            "10 bumps per week",
            "10 watch alerts",
            "Advanced analytics",
            "💎 Premium badge",
            "Featured listings",
            "Priority support"
          ]
        },
        {
          "name": "Bump Credits",
          "price": "TBD",
          "period": "one-time",
          "features": [
            "Purchase bump credits individually",
            "Boost listings to the top of search results",
            "Credits never expire",
            "Use anytime without subscription"
          ]
        },
        {
          "name": "Alert Credits",
          "price": "TBD",
          "period": "one-time",
          "features": [
            "Purchase additional watch alerts",
            "Get notified when wanted items are listed",
            "Credits never expire",
            "Stack on top of free or premium limits"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-11-29",
        "changes": [
          "Initial release with full marketplace functionality",
          "Listing creation with categories, conditions, and images",
          "Global reputation and rating system",
          "Email and admin verification",
          "Smart search with filters and sorting",
          "Watch alerts and seller watchlist",
          "Offer system for negotiations",
          "Report and dispute system",
          "Premium subscription tier",
          "One-time bump and alert credit purchases",
          "Comprehensive /guide help system"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1444097653821542410"
  },
  {
    "id": "130-bot",
    "name": "130 Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1155192681023152241/802bc4a94cd863d74f322f9eab57ad92.png?size=512",
    "bannerImage": "/litarena/screenshots/130-bot/banner.png",
    "description": "Professional eBay market analysis bot powered by 130point.com data. Provides comprehensive sold listing analysis, price trends, market sentiment, and profitability calculations for resellers, collectors, and businesses.",
    "status": "active",
    "features": [
      "Single item eBay sold listing analysis with detailed price statistics",
      "Bulk item analysis for up to 100 items simultaneously",
      "Profitability calculations with fees, taxes, and ROI metrics",
      "Market sentiment indicators (Hot, Stable, Cooling)",
      "Visual price charts with trend lines and breakeven markers",
      "Saved searches with quick re-run functionality",
      "Real-time queue management and progress tracking",
      "CSV export for bulk analysis results",
      "Automatic currency conversion for international sales",
      "Outlier detection and price filtering"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "freemium",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "Single item analysis (!item)",
            "Unlimited saved searches",
            "Queue status monitoring",
            "Help documentation"
          ]
        },
        {
          "name": "Premium",
          "price": "$12.99",
          "period": "month",
          "features": [
            "All Free features",
            "Bulk analysis (!fastitems)",
            "Real-time progress tracking",
            "Downloadable CSV reports",
            "Priority queue processing"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-01-01",
        "changes": [
          "Initial release with single item analysis",
          "Bulk item analysis with premium subscription",
          "Price chart generation",
          "Saved searches functionality",
          "Queue management system"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1155192681023152241"
  },
  {
    "id": "waifu-bot",
    "name": "Waifu Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1255750520103243807/b39ddd029ce811b584d7e628c085cb97.png?size=512",
    "bannerImage": "/litarena/screenshots/waifu-bot/banner.png",
    "description": "Anime character database and interaction bot with character information and image sharing features.",
    "status": "active",
    "features": [
      "Anime character database lookup",
      "Random character image generation",
      "Character information and stats",
      "Favorite character saving"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "free",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "All bot features",
            "Unlimited servers",
            "Community support"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-01-08",
        "changes": [
          "Initial release with character database."
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1255750520103243807"
  },
  {
    "id": "the-manager",
    "name": "The Manager",
    "icon": "https://cdn.discordapp.com/app-icons/1323134432403525694/4176f7f5c30e06a0c2e175600abc5796.png?size=512",
    "bannerImage": "/litarena/screenshots/the-manager/banner.png",
    "description": "Professional ACO (Add-to-Cart Opportunity) management system for sneaker and streetwear communities. Create comprehensive product release forms with interactive features, bulk upload capabilities, automated thread management, and advanced permission controls for organized community collaboration.",
    "status": "active",
    "features": [
      "Interactive ACO form creation with 11+ customizable fields",
      "Bulk upload system with Excel template support (up to 10 forms)",
      "Advanced date validation with TBD (To Be Determined) support",
      "Automated price formatting with flexible range support ($200-250, $300+)",
      "Popular bot integration database with semicolon separation",
      "Real-time image URL validation and accessibility checking",
      "Automatic discussion thread creation for each ACO form",
      "Interactive voting system with upvote/downvote functionality",
      "Anonymous feedback and comment collection system",
      "Drop date reminder system with user notifications",
      "Draft saving and resumption for incomplete forms",
      "Live form editing with field-specific modal dialogs",
      "Role-based permission management for form creation/deletion",
      "Auto-thread locking 7 days after drop date",
      "Thread management with manual lock/unlock controls",
      "Direct signup integration with external form URLs",
      "Persistent view system that survives bot restarts",
      "Rich embed formatting with Discord timestamp integration",
      "Form deletion with confirmation dialogs and cleanup",
      "Session-based data management with backup recovery",
      "Administrative role configuration with server-specific settings",
      "Image attachment support with size and format validation",
      "Bot compatibility tracking for popular sneaker tools",
      "Risk assessment and PAS (Personal Access Sale) management",
      "Comprehensive logging and error handling system"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "freemium",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "Basic bot functionality",
            "Standard commands",
            "Community support"
          ]
        },
        {
          "name": "Premium",
          "price": "$4.99",
          "period": "month",
          "features": [
            "Everything in Free",
            "Advanced features",
            "Priority support",
            "Custom configurations"
          ],
          "popular": true
        }
      ]
    },
    "changelog": [
      {
        "version": "3.2.0",
        "date": "2025-01-15",
        "changes": [
          "Added Excel bulk upload system with template generation",
          "Enhanced image validation with real-time URL checking",
          "Implemented TBD date support for uncertain drop dates",
          "Added popular bot database with improved selection guidance",
          "Enhanced price formatting with range and plus notation support",
          "Improved error handling and user feedback systems",
          "Added comprehensive logging and debugging features"
        ]
      },
      {
        "version": "3.1.0",
        "date": "2025-01-10",
        "changes": [
          "Implemented persistent view system for bot restart resilience",
          "Added automatic thread locking after 7 days past drop date",
          "Enhanced role management with server-specific configurations",
          "Improved draft system with better data persistence",
          "Added form validation with required field enforcement",
          "Enhanced embed formatting with better visual hierarchy"
        ]
      },
      {
        "version": "3.0.0",
        "date": "2025-01-05",
        "changes": [
          "Complete rewrite with interactive button and modal system",
          "Added comprehensive field editing with dropdown selection",
          "Implemented voting system with upvote/downvote functionality",
          "Added comment and feedback collection system",
          "Enhanced permission system with role-based access control",
          "Added thread management and discussion features",
          "Implemented draft saving and resumption capabilities"
        ]
      },
      {
        "version": "2.0.0",
        "date": "2024-12-15",
        "changes": [
          "Added bulk creation with CSV upload support",
          "Implemented template download system",
          "Enhanced date validation with multiple format support",
          "Added image URL validation and formatting",
          "Improved error handling and user guidance"
        ]
      },
      {
        "version": "1.0.0",
        "date": "2024-11-20",
        "changes": [
          "Initial release with basic ACO form creation",
          "Simple embed-based form display",
          "Basic permission management"
        ]
      }
    ],
    "tos": {
      "title": "Terms of Service",
      "sections": [
        {
          "heading": "1. Acceptance of Terms",
          "content": "By using ACO Manager Bot, you agree to these Terms of Service. This bot is designed for legitimate add-to-cart opportunity sharing within sneaker and streetwear communities."
        },
        {
          "heading": "2. Description of Service",
          "content": "ACO Manager provides form creation, bulk upload capabilities, interactive voting, discussion thread management, and administrative tools for organizing product release opportunities. The bot facilitates community collaboration around legitimate retail opportunities."
        },
        {
          "heading": "3. Permitted Use",
          "content": "Users may create ACO forms for legitimate retail opportunities, share accurate product information, participate in community discussions, and use administrative features responsibly. All shared opportunities must comply with retailer terms of service."
        },
        {
          "heading": "4. Prohibited Activities",
          "content": "Users may not share fraudulent opportunities, manipulate voting systems, spam forms or comments, misuse administrative privileges, or engage in any activity that violates Discord's Terms of Service or applicable laws."
        },
        {
          "heading": "5. Data Management",
          "content": "The Bot collects form data, user interactions, voting records, comments, session information, and administrative configurations. All data is used solely for bot functionality and community organization."
        },
        {
          "heading": "6. Content Responsibility",
          "content": "Users are responsible for the accuracy of information in their ACO forms, appropriate use of images and links, compliance with retailer policies, and respectful community interaction. False or misleading information may result in form removal."
        },
        {
          "heading": "7. Administrative Rights",
          "content": "Server administrators and designated role holders have the right to manage permissions, delete inappropriate content, lock discussions, and configure bot settings. These privileges should be used responsibly for community benefit."
        }
      ]
    },
    "privacy": {
      "title": "Privacy Policy",
      "sections": [
        {
          "heading": "1. Data Collection",
          "content": "We collect Discord server IDs, user IDs, ACO form content, voting records, comments and feedback, session data, administrative configurations, and interaction logs necessary for bot operation and community management."
        },
        {
          "heading": "2. Data Usage",
          "content": "Collected data is used to provide ACO form management, facilitate community discussions, enable voting and feedback systems, maintain session persistence, generate analytics for improvement, and support administrative functions."
        },
        {
          "heading": "3. Data Storage and Security",
          "content": "Data is stored securely with appropriate encryption and access controls. Session data is backed up regularly to prevent loss. Administrative configurations are protected and only accessible to authorized personnel."
        },
        {
          "heading": "4. Data Sharing",
          "content": "ACO form information is shared within the Discord server as intended. Voting records and comments are visible to server members. No personal data is shared with external services except Discord's API as required for functionality."
        },
        {
          "heading": "5. Data Retention",
          "content": "ACO forms and associated data are retained while active in the server. Session data is maintained for functionality. Administrative configurations persist until manually changed. Users may request data deletion by removing the bot."
        },
        {
          "heading": "6. User Rights",
          "content": "Users can edit their ACO forms, delete their content, view their voting history, access their saved drafts, and request data removal. Server administrators have additional rights to manage community content and settings."
        },
        {
          "heading": "7. Third-Party Integration",
          "content": "The bot integrates with Discord's API, external image hosting services for validation, and Excel/CSV processing libraries. No third-party services have access to sensitive user data beyond what's necessary for functionality."
        }
      ]
    },
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1323134432403525694"
  },
  {
    "id": "scratch-bot",
    "name": "Scratch Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1408793269642727434/2baa768c7721594c037ddfbecffb1634.png?size=512",
    "bannerImage": "/litarena/screenshots/scratch-bot/banner.png",
    "description": "Multi-state scratch-off lottery analysis bot that helps users find the best scratch-off tickets using data-driven analysis for Texas and Oklahoma lotteries.",
    "status": "active",
    "features": [
      "Multi-state lottery support (Texas & Oklahoma)",
      "Win probability calculations based on remaining prizes",
      "Expected value (EV) and ROI analysis",
      "Composite scoring for balanced game ranking",
      "10 category-based filters (Best ROI, Best Odds, Budget, Premium, etc.)",
      "User and server-wide state preferences",
      "Detailed game analytics with prize tier breakdowns",
      "Smart 15-minute caching for fast responses",
      "Price filtering for any ticket price point",
      "Overall lottery statistics per state"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "free",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "All lottery analysis features",
            "All category filters",
            "Detailed game analytics",
            "User and server preferences",
            "Unlimited servers"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-01-01",
        "changes": [
          "Initial release with Texas and Oklahoma lottery support",
          "Category-based game filtering",
          "Win probability and EV calculations",
          "User and server state preferences",
          "Smart caching system"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1408793269642727434"
  },
  {
    "id": "coc-watcher",
    "name": "CoC Watcher",
    "icon": "https://cdn.discordapp.com/app-icons/1406242315336683692/5a51f232198bf29a81c69a94db1b48c2.png?size=512",
    "bannerImage": "/litarena/screenshots/coc-watcher/banner.png",
    "description": "CoC Watcher provides real-time monitoring and analytics for Clash of Clans wars.",
    "status": "active",
    "features": [
      "Real-time war status monitoring",
      "Detailed war analytics and history",
      "League War overview and tracking",
      "Player performance statistics"
    ],
    "screenshots": [
      "/litarena/screenshots/coc-watcher/screenshot-1.png",
      "/litarena/screenshots/coc-watcher/screenshot-2.png",
      "/litarena/screenshots/coc-watcher/screenshot-3.png",
      "/litarena/screenshots/coc-watcher/screenshot-4.png",
      "/litarena/screenshots/coc-watcher/screenshot-5.png",
      "/litarena/screenshots/coc-watcher/screenshot-6.png"
    ],
    "videos": [],
    "pricing": {
      "model": "freemium",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "Current War Status & Basic Analytics",
            "Current League War overview"
          ]
        },
        {
          "name": "Premium",
          "price": "$1.99",
          "period": "month",
          "features": [
            "Complete War History & Analytics",
            "Access last 10 regular wars",
            "Capital Raids season tracking",
            "Last 10 CWL seasons data",
            "Individual player statistics",
            "Missed attacks identification",
            "Performance charts & graphs"
          ],
          "popular": true
        },
        {
          "name": "Premium Plus",
          "price": "$2.99",
          "period": "month",
          "features": [
            "Advanced Performance Management",
            "Top/Bottom 8 player rankings",
            "Performance overview dashboard",
            "Activity-based scoring system",
            "Medal distribution insights",
            "Identify underperformers",
            "Advanced analytics engine",
            "All Premium features included"
          ],
          "popular": false
        }
      ]
    },
    "changelog": [],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1406242315336683692"
  },
  {
    "id": "saveit",
    "name": "SaveIt",
    "icon": "https://cdn.discordapp.com/app-icons/1433229400769429625/71b1ec889af984f844bf3a8048746119.png?size=512",
    "bannerImage": "/litarena/screenshots/saveit/banner.png",
    "description": "A powerful Discord bot for saving, organizing, and retrieving important Discord messages and personal notes with collections, smart tagging, and fuzzy search.",
    "status": "active",
    "features": [
      "Save Discord messages as bookmarks with notes and tags",
      "Create and organize personal notes",
      "Collections for grouping bookmarks (public or private)",
      "Reaction bookmarking with 🔖 emoji",
      "Smart tagging with autocomplete",
      "Pin favorites to top of lists",
      "Share bookmarks and notes with other users",
      "Fuzzy search across all content",
      "Statistics dashboard with usage insights",
      "URL import for web bookmarks",
      "Batch operations for multiple items",
      "Export to CSV or Markdown",
      "Duplicate detection",
      "Featured bookmarks for servers (Admin)"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "freemium",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "Basic bookmarks and notes",
            "Tag organization",
            "Search functionality",
            "Reaction bookmarking"
          ]
        },
        {
          "name": "Premium",
          "price": "$4.99",
          "period": "month",
          "features": [
            "Unlimited bookmarks across all servers",
            "Unlimited notes and emoji mappings",
            "Unlimited collections",
            "Advanced search and filtering",
            "Markdown export",
            "Pin important items",
            "Share with unlimited users",
            "Priority support"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-01-01",
        "changes": [
          "Initial release with bookmark and note management",
          "Collections for organizing bookmarks",
          "Reaction bookmarking with 🔖",
          "Smart tagging with autocomplete",
          "Fuzzy search functionality",
          "Export to CSV and Markdown"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1433229400769429625"
  },
  {
    "id": "anonymous-art",
    "name": "Anonymous Art",
    "icon": "https://cdn.discordapp.com/app-icons/1432939933454041233/7f8b4f3f437b1d8c4add66ff4737f072.png?size=512",
    "bannerImage": "/litarena/screenshots/anonymous-art/banner.png",
    "description": "Discord bot for managing anonymous creative contests with fair voting systems. All submissions are kept anonymous until voting ends!",
    "status": "beta",
    "features": [
      "Anonymous submission system",
      "Fair voting with multiple voting modes",
      "Customizable submission and voting periods",
      "Moderator review and approval workflow",
      "Automatic winner announcements",
      "Contest analytics and statistics",
      "Per-server configuration",
      "Scheduled contest automation"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "free",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "All bot features",
            "Unlimited servers",
            "Unlimited contests",
            "Community support"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-11-29",
        "changes": [
          "Initial release with anonymous contest management.",
          "Submission and voting system.",
          "Moderation tools and analytics."
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1432939933454041233"
  },
  {
    "id": "shopguard",
    "name": "ShopGuard",
    "icon": "https://cdn.discordapp.com/app-icons/1445192539878457465/91be80353d33a1aba8e63ff53f876b9a.png?size=512",
    "bannerImage": "/litarena/screenshots/shopguard/banner.png",
    "description": "A Discord bot integrated with Shopify for Local Game Stores (LGS) and Local Card Stores (LCS) to sell inventory directly to their community while preventing bot sniping and ensuring fair access.",
    "status": "beta",
    "features": [
      "Multi-layer bot protection and verification",
      "Product drop creation and management from Discord",
      "Private invoice system with hidden inventory",
      "Fair queue system with randomized purchase order",
      "Real-time analytics and drop performance tracking",
      "Seamless Shopify store integration and sync",
      "Advanced security with rate limiting and abuse prevention",
      "Role-based access control and conditional verification",
      "Automated scheduling for releases and drops",
      "Customizable verification settings per server",
      "Private channel management for exclusive access",
      "Invoice generation via Shopify draft orders",
      "Guild configuration and admin dashboard",
      "Webhook notifications for drop events",
      "Comprehensive moderation and approval workflows"
    ],
    "screenshots": [
      "/litarena/screenshots/shopguard/screenshot-1.png",
      "/litarena/screenshots/shopguard/screenshot-2.jpeg",
      "/litarena/screenshots/shopguard/screenshot-3.jpeg",
      "/litarena/screenshots/shopguard/screenshot-4.jpeg"
    ],
    "videos": [],
    "pricing": {
      "model": "subscription",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "All core bot features",
            "Unlimited servers",
            "Unlimited drops and releases",
            "Basic verification and queue system",
            "Community support"
          ]
        },
        {
          "name": "Pro",
          "price": "$29",
          "period": "month",
          "features": [
            "Everything in Free",
            "Advanced analytics and reporting",
            "Priority support",
            "Custom branding options",
            "No 'Powered by' branding"
          ]
        },
        {
          "name": "Enterprise",
          "price": "$79",
          "period": "month",
          "features": [
            "Everything in Pro",
            "White-label solution",
            "Dedicated support",
            "Advanced customization",
            "API access"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "0.1.0",
        "date": "2025-12-01",
        "changes": [
          "Initial beta release with core functionality.",
          "Bot setup, Discord integration, and basic Shopify API connection.",
          "Release creation, user verification, and queue system.",
          "Private channels, invoice generation, and basic analytics."
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1445192539878457465"
  },
  {
    "id": "japanese-translator-bot",
    "name": "Japanese Tweet Translator",
    "icon": "https://cdn.discordapp.com/app-icons/1447448485354803201/b9d395d27eb4eef9a02e7e7072b80297.png?size=512",
    "bannerImage": "/litarena/screenshots/japanese-translator-bot/banner.png",
    "description": "A Discord bot that automatically translates Japanese text in messages, embeds, and RSS feeds to English. Supports manual translations and premium RSS monitoring for comprehensive Japanese content translation.",
    "status": "released",
    "features": [
      "Automatic translation of Japanese messages in monitored channels",
      "Translation of embeds and forwarded content",
      "Manual translation commands",
      "Premium RSS feed monitoring with automatic translations",
      "Channel monitoring setup with !set_channels command",
      "Premium subscription for enhanced features",
      "Daily premium entitlement checks",
      "Support for multiple channels (up to 5 with premium)",
      "Real-time translation using Google Translate API",
      "Guild-specific configuration and data persistence"
    ],
    "screenshots": [],
    "videos": [
      "/litarena/screenshots/japanese-translator-bot/video-1.mov"
    ],
    "pricing": {
      "model": "subscription",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "Translate Japanese messages and embeds",
            "Monitor 1 channel",
            "Basic translation features",
            "Community support"
          ]
        },
        {
          "name": "Premium",
          "price": "$2.99",
          "period": "month",
          "features": [
            "Everything in Free",
            "Automatic RSS feed monitoring",
            "Monitor up to 5 channels",
            "Priority support",
            "Enhanced features"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-12-08",
        "changes": [
          "Initial release with core translation functionality",
          "Discord integration and bot setup",
          "Channel monitoring and RSS feed support",
          "Premium subscription system",
          "Automatic translation of messages, embeds, and RSS feeds"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1447448485354803201"
  },
  {
    "id": "secret-santa-helper-bot",
    "name": "Secret Santa Discord Bot",
    "icon": "https://cdn.discordapp.com/app-icons/1448452940254810212/f41ac92c7caa09c487495a768fa00dc5.png?size=512",
    "bannerImage": "/litarena/screenshots/secret-santa-helper/banner.png",
    "description": "The ultimate Discord bot for organizing Secret Santa events with premium features and customization. Supports up to 50 participants in the free tier and unlimited with premium purchase.",
    "status": "released",
    "features": [
      "Create Secret Santa events (1 active event at a time in free tier)",
      "Up to 50 participants per event (unlimited with premium)",
      "Automated Secret Santa assignments",
      "Anonymous messaging between Santa and giftee",
      "Wishlist management",
      "Participant profiles with interests",
      "Shipping address collection",
      "Event management (create, start, assign)",
      "Privacy-focused (encrypted data, auto-deletion)",
      "Premium: Multiple concurrent events",
      "Premium: Budget tracking and management",
      "Premium: Advanced wishlists with product scraping",
      "Premium: Automated reminders",
      "Premium: Gift tracking (purchase, shipping, delivery)",
      "Premium: Event templates",
      "Premium: Full customization (colors, messages, branding)",
      "Premium: Custom questionnaires",
      "Premium: Advanced restrictions (geographic matching, exclusions)",
      "Premium: Analytics dashboard",
      "Premium: Export data as CSV/Excel",
      "Premium: Priority support"
    ],
    "screenshots": [],
    "videos": [],
    "pricing": {
      "model": "one-time",
      "tiers": [
        {
          "name": "Free",
          "price": "$0",
          "period": "forever",
          "features": [
            "Create Secret Santa events (1 active at a time)",
            "Up to 50 participants per event",
            "Automated assignments",
            "Anonymous messaging",
            "Wishlist management",
            "Participant profiles",
            "Shipping address collection",
            "Event management",
            "Privacy-focused features",
            "Community support"
          ]
        },
        {
          "name": "Premium",
          "price": "$9.99",
          "period": "one-time",
          "features": [
            "Everything in Free",
            "Unlimited participants",
            "Multiple concurrent events",
            "Budget tracking",
            "Advanced wishlists with product scraping",
            "Automated reminders",
            "Gift tracking",
            "Event templates",
            "Full customization",
            "Custom questionnaires",
            "Advanced restrictions",
            "Analytics dashboard",
            "Export data",
            "Priority support"
          ]
        }
      ]
    },
    "changelog": [
      {
        "version": "1.0.0",
        "date": "2025-12-11",
        "changes": [
          "Initial release with core Secret Santa functionality",
          "Discord integration and bot setup",
          "Event management, participant handling, and assignments",
          "Wishlist and messaging features",
          "Premium monetization system with Discord SKU",
          "Privacy-focused data handling and auto-deletion"
        ]
      }
    ],
    "tos": null,
    "privacy": null,
    "installUrl": "https://discord.com/oauth2/authorize?client_id=1448452940254810212"
  }
]